Repository: isabelleysseric/ProductsApiRestProject
Catalog: doc/locale/*/LC_MESSAGES/installation.po
Languages: fr

source: This section provides instructions on how to set up and install ProductsApiRestProject.
fr: Cette section fournit des instructions sur la configuration et l'installation de ProductsApiRestProject.

source: Prerequisites
fr: Prérequis

source: Before you begin, ensure you have met the following requirements:
fr: Avant de commencer, assurez-vous d'avoir respecté les exigences suivantes :

source: **.NET Core SDK**: Download and install from [Microsoft's official site](https://dotnet.microsoft.com/download).
fr: **.NET Core SDK** : Téléchargez et installez depuis le [site officiel de Microsoft](https://dotnet.microsoft.com/download).

source: **Python 3.x**: Download and install from [Python's official site](https://www.python.org/downloads/).
fr: **Python 3.x** : Téléchargez et installez depuis le [site officiel de Python](https://www.python.org/downloads/).

source: **Sphinx**: Install using pip:
fr: **Sphinx** : Installez avec pip :

source: **MikTeX (Windows)** or **TeX Live (Linux/macOS)**: Required for PDF documentation generation.
fr: **MikTeX (Windows)** ou **TeX Live (Linux/macOS)** : Requis pour la génération de documentation en PDF.

source: Steps to Install
fr: Étapes d'installation

source: Follow these steps to set up and install ProductsApiRestProject:
fr: Suivez ces étapes pour configurer et installer ProductsApiRestProject :

source: **Clone the Repository**:
fr: **Cloner le dépôt** :

source: **Restore .NET Dependencies**:
fr: **Restaurer les dépendances .NET** :

source: **Set Up Python Environment** (Optional):
fr: **Configurer l'environnement Python** (Optionnel) :

source: It's recommended to use a virtual environment:
fr: Il est recommandé d'utiliser un environnement virtuel :

source: Install the required Python packages:
fr: Installez les packages Python requis :

source: **Verify Installation**:
fr: **Vérifier l'installation** :

source: Make sure everything is installed correctly by running:
fr: Assurez-vous que tout est installé correctement en exécutant :

source: The API should now be running at `http://localhost:5000`.
fr: L'API devrait maintenant fonctionner à l'adresse `http://localhost:5000`.

source: Next Steps
fr: Étapes suivantes

source: Once the installation is complete, you can start using the API.
fr: Une fois l'installation terminée, vous pouvez commencer à utiliser l'API.

source: See the :doc:`usage` section for detailed usage instructions.
fr: Consultez la section :doc:`usage` pour des instructions détaillées sur l'utilisation.
