Repository: isabelleysseric/ProductsApiRestProject
Catalog: doc/locale/*/LC_MESSAGES/usage.po
Languages: fr

source: Usage
fr: Utilisation

source: This section provides instructions on how to use ProductsApiRestProject.
fr: Cette section fournit des instructions sur l'utilisation de ProductsApiRestProject.

source: Starting the API
fr: Démarrer l'API

source: To start the API, navigate to the project directory and run the following command:
fr: Pour démarrer l'API, accédez au répertoire du projet et exécutez la commande suivante :

source: The API will be accessible at `http://localhost:5000`.
fr: L'API sera accessible à l'adresse `http://localhost:5000`.

source: API Endpoints
fr: Points de terminaison de l'API

source: ProductsApiRestProject provides the following endpoints:
fr: ProductsApiRestProject fournit les points de terminaison suivants :

source: Items
fr: Éléments

source: **GET** `/api/items` - Retrieve all items
fr: **GET** `/api/items` - Récupérer tous les éléments

source: **GET** `/api/items/{id}` - Retrieve a specific item by ID
fr: **GET** `/api/items/{id}` - Récupérer un élément spécifique par ID

source: **POST** `/api/items` - Add a new item
fr: **POST** `/api/items` - Ajouter un nouvel élément

source: **PUT** `/api/items/{id}` - Update an existing item
fr: **PUT** `/api/items/{id}` - Mettre à jour un élément existant

source: **DELETE** `/api/items/{id}` - Delete an item
fr: **DELETE** `/api/items/{id}` - Supprimer un élément

source: Products
fr: Produits

source: **GET** `/api/products` - Retrieve all products
fr: **GET** `/api/products` - Récupérer tous les produits

source: **GET** `/api/products/{id}` - Retrieve a specific product by ID
fr: **GET** `/api/products/{id}` - Récupérer un produit spécifique par ID

source: **POST** `/api/products` - Add a new product
fr: **POST** `/api/products` - Ajouter un nouveau produit

source: **PUT** `/api/products/{id}` - Update an existing product
fr: **PUT** `/api/products/{id}` - Mettre à jour un produit existant

source: **DELETE** `/api/products/{id}` - Delete a product
fr: **DELETE** `/api/products/{id}` - Supprimer un produit

source: Example Requests
fr: Exemples de requêtes

source: Here are some examples of how to interact with the API using `curl`.
fr: Voici quelques exemples d'interaction avec l'API en utilisant `curl`.

source: Retrieve All Items
fr: Récupérer tous les éléments

source: Add a New Product
fr: Ajouter un nouveau produit

source: Update an Existing Item
fr: Mettre à jour un élément existant

source: Delete a Product
fr: Supprimer un produit

source: Next Steps
fr: Étapes suivantes

source: To contribute to the project, see the `CONTRIBUTING.md` file.
fr: Pour contribuer au projet, consultez le fichier `CONTRIBUTING.md`.

source: For more details on the API, refer to the `API Reference` (if available).
fr: Pour plus de détails sur l'API, consultez la `Référence de l'API` (si disponible).
